/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               zyUSBDev.h
** Latest modified Date:    2009-03-31
** Latest Version:          1.0
** Descriptions:            zyUSBDev动态库头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              LingGuilin
** Created date:            2009-03-31
** Version:                 1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/

#ifndef __zyUSBDev_H
#define __zyUSBDev_H

/*********************************************************************************************************
  下面为向用户开放的 API 函数
*********************************************************************************************************/

/*********************************************************************************************************
** Function name:       zyUSB_ReadData
** Descriptions:        从USB设备的IN端点读取数据
** input parameters:    siPipeNum:    所要操作的管道号,可以是0,2,4,6,8,10,12
**                                    实际可用参数由设备端提供的端点数目决定
**                                    0对应USB Device控制器的物理端点3(IN)
**                                    2对应USB Device控制器的物理端点5(IN)
**                      pucRcvBuf:    接收数据缓冲区
**                      siReadLen:    接收数据字节数
**                      siWaitTime:   等待超时时间,单位ms，为-1表示一直等待
** output parameters:   无
** Returned value:      读取成功为读取到的字节数，否则为-1
*********************************************************************************************************/
int __stdcall zyUSB_ReadData(int siPipeNum,
                             unsigned char *pucRcvBuf,
                             int siReadLen,
                             int siWaitTime);

/*********************************************************************************************************
** Function name:        zyUSB_WriteData
** Descriptions:        向USB设备的OUT端点写入数据
** input parameters:    siPipeNum:    所要操作的管道号,可以是1,3,5,7,9,11,13
**                                    实际可用参数由设备端提供的端点数目决定
**                                    1对应USB Device控制器的物理端点2(OUT)
**                                    3对应USB Device控制器的物理端点4(OUT)
**                      pucSendBuf:   发送数据缓冲区
**                      siSendLen:    发送数据字节数
**                      siWaitTime:   等待超时时间,单位ms，为-1表示一直等待
** output parameters:   无
** Returned value:      发送成功为发送的字节数，否则为-1
*********************************************************************************************************/
int __stdcall zyUSB_WriteData(int siPipeNum,
                              unsigned char *pucSendBuf,
                              int siSendLen,
                              int siWaitTime);

#endif                                                                  /*  __zyUSBDev_H                */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/