/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               usbDevHAL.h
** Latest modified Date:    2008-05-10
** Latest Version:          1.1
** Descriptions:            usbDevLPC2400 固件程序硬件抽象层头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              ZhengMingyuan
** Created date:            2005-08-08
** Version:                 1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             LingGuilin
** Modified date:           2008-05-10
** Version:                 1.1
** Descriptions:            修改部分代码以适合SmartARM2400系列开发板
**
*********************************************************************************************************/

#ifndef __USBDEVHAL_H
#define __USBDEVHAL_H

/*********************************************************************************************************
** Function name:       __usbDevHardwareInit
** Descriptions:        初始化 USB 设备控制器硬件
** input parameters:    无
** output parameters:   无
** Returned value:      无
*********************************************************************************************************/
extern void __usbDevHardwareInit (void);

/*********************************************************************************************************
** Function name:       __usbDevHadwareReconnect
** Descriptions:        重新连接 USB 总线
** input parameters:    无
** output parameters:   无
** Returned value:      无
*********************************************************************************************************/
extern void __usbDevHadwareReconnect (void);

/*********************************************************************************************************
** Function name:       __usbDevIntConfig
** Descriptions:        配置USB设备控制器的中断
** input parameters:    无
** output parameters:   无
** Returned value:      无
*********************************************************************************************************/
extern void __usbDevIntConfig (void);

#endif                                                                  /*  __USBDEVHAL_H               */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/


